[
  {
    "title": "How do I start investing with $100 per month?",
    "text": "I'm 23, just started my first job. I can set aside about $100/mo. Should I do a Roth IRA or open a brokerage? What are the first steps and what’s a realistic approach?"
  },
  {
    "title": "Student loan repayment changes & best strategy",
    "text": "I’m confused by new student loan repayment options (SAVE vs REPAYE). Is there a calculator or .gov page that explains the eligibility and pros/cons?"
  },
  {
    "title": "Credit cards for building credit (beginner)",
    "text": "What’s a good first credit card to build credit safely? How do I avoid fees and keep utilization low so my credit score improves?"
  },
  {
    "title": "Budgeting on a variable income",
    "text": "I’m a freelancer with irregular monthly income. How do I build a 50/30/20 budget that handles months with low cash flow?"
  },
  {
    "title": "Investing vs paying off high-interest debt first",
    "text": "I have $5k in savings, a small emergency fund, and a credit card with 24% APR. Should I prioritize paying off the card before investing?"
  },
  {
    "title": "Roth IRA vs Traditional — which one for me?",
    "text": "I’m 26 in a 22% tax bracket. Employer 401k match is 3%. Should I max Roth IRA first, get the match, or focus on emergency fund?"
  },
  {
    "title": "Is this crypto 'guaranteed 5x' opportunity legit?",
    "text": "Friend says there’s a guaranteed 5x coin. Claims it’s risk-free and a secret insider tip. Sounds too good to be true but I’m tempted."
  },
  {
    "title": "Best high-yield savings account right now",
    "text": "Where do I park my emergency fund? Are there .gov resources or reputable comparisons for APY, fees, and insurance (FDIC/NCUA)?"
  },
  {
    "title": "How to start a simple emergency fund",
    "text": "What’s a step-by-step plan for a $1,000 emergency fund when my rent and groceries already take most of my paycheck? Any tips to automate?"
  },
  {
    "title": "Beginner ETF picks for long-term investing",
    "text": "Looking for simple, low-fee ETFs to start with. What’s an expense ratio to aim for, and how often should I rebalance?"
  }
]